W6/D3/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
---
  def index
    artworks = Artwork.joins.(:shared_viewers).where(['artist_id = ?', params[:user_id]])