W6/D3/first_routes/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Bob Burgerman"], ["email", "bob@burgermeister.com"], ["updated_at", "2021-10-07 17:19:53.791799"], ["id", 3]]