W7/D5/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "beepboop"], ["description", "i hate humans"], ["moderator_id", 1], ["created_at", "2021-10-15 23:59:03.030380"], ["updated_at", "2021-10-15 23:59:03.030380"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = params[:user_id]
    if @sub.save