W7/D5/RedditClone/app/controllers/users_controller.rb

  def create
    @user = User.new(params.require(:user).permit(:username, :password))
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"